Repository: tisfeng/Easydict
Catalog: Easydict/App/Localizable.xcstrings
Source language: en
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fil, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, lo, lt, lv, mn_mong, ms, my, nb, nl, pl, pt, pt_br, ro, ru, sk, sl, sr_cyrl, sv, ta, te, th, tr, ug, uk, ur, vi, zh_hans, zh_hant

# grammar.analysis.ielts.rewrite.higher_band
source: Higher-band version
ar: نسخة بدرجة أعلى
bg: Версия за по-висок резултат
bn: উচ্চতর ব্যান্ড সংস্করণ
ca: Versió de banda més alta
cs: Verze na vyšší úrovni
da: Version til højere båndscore
de: Version für ein höheres Band
el: Εκδοχή υψηλότερης βαθμίδας
es: Versión de banda más alta
et: Kõrgema taseme versioon
fa: نسخه با نمره بالاتر
fi: Korkeamman tason versio
fil: Bersyon para sa mas mataas na band
fr: Version de niveau supérieur
he: גרסה ברמת ציון גבוהה יותר
hi: उच्च बैंड संस्करण
hr: Verzija za viši band
hu: Magasabb szintű változat
id: Versi dengan band lebih tinggi
it: Versione di livello superiore
ja: より高いバンドの表現
ka: უფრო მაღალი დონის ვერსია
km: កំណែពិន្ទុខ្ពស់ជាង
ko: 더 높은 밴드 버전
lo: ສະບັບຄະແນນສູງກວ່າ
lt: Aukštesnio lygio versija
lv: Augstāka līmeņa versija
mn_mong: Илүү өндөр түвшний хувилбар
ms: Versi band lebih tinggi
my: ပိုမြင့်သော band အဆင့် ဗားရှင်း
nb: Versjon for høyere båndscore
nl: Versie voor een hogere bandscore
pl: Wersja na wyższym poziomie
pt: Versão de banda mais alta
pt_br: Versão de banda mais alta
ro: Versiune de nivel mai înalt
ru: Версия на более высокий балл
sk: Verzia na vyššej úrovni
sl: Različica na višji ravni
sr_cyrl: Верзија вишег нивоа
sv: Version för högre bandpoäng
ta: உயர்ந்த பாண்ட் பதிப்பு
te: అధిక బ్యాండ్ సంస్కరణ
th: เวอร์ชันระดับคะแนนสูงกว่า
tr: Daha yüksek bant sürümü
ug: تېخىمۇ يۇقىرى سەۋىيەلىك نۇسخا
uk: Версія вищого рівня
ur: زیادہ بلند بینڈ والا نسخہ
vi: Phiên bản band cao hơn
zh_hans: 更高分版本
zh_hant: 更高分版本

# grammar.analysis.ielts.rewrite.minimal
source: Minimal correction
ar: التصحيح الأدنى
bg: Минимална корекция
bn: সর্বনিম্ন সংশোধন
ca: Correcció mínima
cs: Minimální oprava
da: Minimal rettelse
de: Minimale Korrektur
el: Ελάχιστη διόρθωση
es: Corrección mínima
et: Minimaalne parandus
fa: اصلاح حداقلی
fi: Minimaalinen korjaus
fil: Pinakamaliit na pagwawasto
fr: Correction minimale
he: תיקון מינימלי
hi: न्यूनतम सुधार
hr: Minimalna ispravka
hu: Minimális javítás
id: Perbaikan minimal
it: Correzione minima
ja: 最小限の修正
ka: მინიმალური შესწორება
km: ការកែតម្រូវតិចបំផុត
ko: 최소 수정
lo: ການແກ້ໄຂນ້ອຍທີ່ສຸດ
lt: Minimalus pataisymas
lv: Minimāls labojums
mn_mong: Хамгийн бага засвар
ms: Pembetulan minimum
my: အနည်းဆုံး ပြင်ဆင်ချက်
nb: Minimal korrigering
nl: Minimale correctie
pl: Minimalna korekta
pt: Correção mínima
pt_br: Correção mínima
ro: Corecție minimă
ru: Минимальная правка
sk: Minimálna oprava
sl: Minimalni popravek
sr_cyrl: Минимална исправка
sv: Minimal korrigering
ta: குறைந்தபட்ச திருத்தம்
te: కనిష్ట సవరణ
th: การแก้ไขขั้นต่ำ
tr: En az düzeltme
ug: ئەڭ ئاز تۈزىتىش
uk: Мінімальне виправлення
ur: کم سے کم درستی
vi: Chỉnh sửa tối thiểu
zh_hans: 最小修正
zh_hant: 最小修正

# grammar.analysis.skipped
source: The current text is too short or does not look like analyzable natural language, so grammar analysis was skipped.
ar: النص الحالي قصير جدًا أو لا يبدو لغة طبيعية قابلة للتحليل النحوي، لذلك تم تخطي التحليل النحوي.
bg: Текущият текст е твърде кратък или не изглежда като естествен език, подходящ за граматичен анализ, затова анализът беше пропуснат.
bn: বর্তমান লেখাটি খুব ছোট, বা এটি ব্যাকরণ বিশ্লেষণের উপযোগী প্রাকৃতিক ভাষা বলে মনে হচ্ছে না, তাই বিশ্লেষণটি এড়িয়ে যাওয়া হয়েছে।
ca: El text actual és massa curt o no sembla llenguatge natural apte per a l'anàlisi gramatical, de manera que s'ha omès l'anàlisi.
cs: Aktuální text je příliš krátký nebo nevypadá jako přirozený jazyk vhodný pro gramatickou analýzu, proto byla analýza přeskočena.
da: Den aktuelle tekst er for kort eller ligner ikke naturligt sprog, der kan grammatikanalyseres, så grammatikanalysen blev sprunget over.
de: Der aktuelle Text ist zu kurz oder sieht nicht wie analysierbare natürliche Sprache aus, daher wurde die Grammatikanalyse übersprungen.
el: Το τρέχον κείμενο είναι πολύ σύντομο ή δεν φαίνεται να είναι φυσική γλώσσα κατάλληλη για γραμματική ανάλυση, οπότε η ανάλυση παραλείφθηκε.
es: El texto actual es demasiado corto o no parece lenguaje natural apto para análisis gramatical, por lo que se omitió el análisis.
et: Praegune tekst on liiga lühike või ei näi olevat loomulik keel, mida saaks grammatiliselt analüüsida, seega analüüs jäeti vahele.
fa: متن فعلی خیلی کوتاه است یا شبیه زبان طبیعیِ قابل تحلیل از نظر دستور زبان نیست، بنابراین تحلیل دستور زبان نادیده گرفته شد.
fi: Nykyinen teksti on liian lyhyt tai ei näytä kieliopilliseen analyysiin sopivalta luonnolliselta kieleltä, joten analyysi ohitettiin.
fil: Masyadong maikli ang kasalukuyang teksto o hindi ito mukhang natural na wikang maaaring suriin sa gramatika, kaya nilaktawan ang pagsusuri.
fr: Le texte actuel est trop court ou ne semble pas être un langage naturel pouvant faire l'objet d'une analyse grammaticale, donc l'analyse a été ignorée.
he: הטקסט הנוכחי קצר מדי או שאינו נראה כשפה טבעית שניתן לנתח דקדוקית, ולכן הניתוח הדקדוקי דולג.
hi: वर्तमान पाठ बहुत छोटा है या व्याकरण विश्लेषण के लिए उपयुक्त प्राकृतिक भाषा जैसा नहीं लगता, इसलिए व्याकरण विश्लेषण छोड़ दिया गया।
hr: Trenutni tekst je prekratak ili ne izgleda kao prirodan jezik prikladan za gramatičku analizu, pa je analiza preskočena.
hu: A jelenlegi szöveg túl rövid, vagy nem tűnik nyelvtanilag elemezhető természetes nyelvnek, ezért a nyelvtani elemzés ki lett hagyva.
id: Teks saat ini terlalu pendek atau tidak tampak seperti bahasa alami yang layak dianalisis tata bahasanya, sehingga analisis dilewati.
it: Il testo attuale è troppo breve o non sembra un linguaggio naturale adatto all'analisi grammaticale, quindi l'analisi è stata saltata.
ja: 現在のテキストは短すぎるか、文法解析に適した自然言語に見えないため、文法解析をスキップしました。
ka: მიმდინარე ტექსტი ზედმეტად მოკლეა ან არ ჰგავს გრამატიკული ანალიზისთვის შესაბამის ბუნებრივ ენას, ამიტომ ანალიზი გამოტოვებულია.
km: អត្ថបទបច្ចុប្បន្នខ្លីពេក ឬមិនមើលទៅដូចជាភាសាធម្មជាតិដែលសមស្របសម្រាប់ការវិភាគវេយ្យាករណ៍ ដូច្នេះបានរំលងការវិភាគ។
ko: 현재 텍스트가 너무 짧거나 문법 분석에 적합한 자연어로 보이지 않아 문법 분석을 건너뛰었습니다.
lo: ຂໍ້ຄວາມປະຈຸບັນສັ້ນເກີນໄປ ຫຼືບໍ່ເບິ່ງຄືພາສາທຳມະຊາດທີ່ເໝາະສຳລັບການວິເຄາະໄວຍາກອນ ດັ່ງນັ້ນຈຶ່ງຂ້າມການວິເຄາະ.
lt: Dabartinis tekstas yra per trumpas arba neatrodo kaip natūrali kalba, tinkama gramatinei analizei, todėl analizė buvo praleista.
lv: Pašreizējais teksts ir pārāk īss vai neizskatās pēc dabiskas valodas, ko var analizēt gramatiski, tāpēc analīze tika izlaista.
mn_mong: Одоогийн текст хэт богино эсвэл дүрмийн хувьд шинжлэхэд тохирох байгалийн хэл шиг харагдахгүй тул шинжилгээг алгаслаа.
ms: Teks semasa terlalu pendek atau tidak kelihatan seperti bahasa semula jadi yang sesuai untuk analisis tatabahasa, maka analisis dilangkau.
my: လက်ရှိစာသားသည် အလွန်တိုလွန်းသည် သို့မဟုတ် သဒ္ဒါခွဲခြမ်းစိတ်ဖြာရန် သင့်တော်သော သဘာဝဘာသာစကားဟု မထင်ရသောကြောင့် ခွဲခြမ်းစိတ်ဖြာမှုကို ကျော်သွားခဲ့သည်။
nb: Den nåværende teksten er for kort eller ser ikke ut som naturlig språk som kan analyseres grammatisk, så analysen ble hoppet over.
nl: De huidige tekst is te kort of lijkt geen natuurlijke taal die grammaticaal analyseerbaar is, dus is de grammatica-analyse overgeslagen.
pl: Obecny tekst jest zbyt krótki lub nie wygląda na naturalny język nadający się do analizy gramatycznej, więc analiza została pominięta.
pt: O texto atual é muito curto ou não parece linguagem natural adequada para análise gramatical, por isso a análise foi ignorada.
pt_br: O texto atual é muito curto ou não parece linguagem natural adequada para análise gramatical, por isso a análise foi ignorada.
ro: Textul actual este prea scurt sau nu pare a fi limbaj natural potrivit pentru analiză gramaticală, astfel că analiza a fost omisă.
ru: Текущий текст слишком короткий или не похож на естественный язык, пригодный для грамматического анализа, поэтому анализ был пропущен.
sk: Aktuálny text je príliš krátky alebo nevyzerá ako prirodzený jazyk vhodný na gramatickú analýzu, preto bola analýza preskočená.
sl: Trenutno besedilo je prekratko ali pa ni videti kot naravni jezik, primeren za slovnično analizo, zato je bila analiza preskočena.
sr_cyrl: Тренутни текст је прекратак или не личи на природан језик погодан за граматичку анализу, па је анализа прескочена.
sv: Den aktuella texten är för kort eller ser inte ut som naturligt språk som går att grammatikanalysera, så grammatikanalysen överhoppades.
ta: தற்போதைய உரை மிகக் குறுகியது அல்லது இலக்கண பகுப்பாய்விற்கு ஏற்ற இயல்பான மொழியாகத் தெரியவில்லை; எனவே பகுப்பாய்வு தவிர்க்கப்பட்டது.
te: ప్రస్తుతం ఉన్న పాఠ్యం చాలా చిన్నదిగా ఉంది లేదా వ్యాకరణ విశ్లేషణకు సరిపోయే సహజ భాషలా కనిపించడం లేదు, కాబట్టి విశ్లేషణను దాటవేశారు.
th: ข้อความปัจจุบันสั้นเกินไป หรือดูไม่เหมือนภาษาธรรมชาติที่เหมาะสำหรับการวิเคราะห์ไวยากรณ์ จึงข้ามการวิเคราะห์ไวยากรณ์
tr: Mevcut metin çok kısa ya da dil bilgisi açısından analiz edilebilecek doğal bir dil gibi görünmüyor, bu yüzden dil bilgisi analizi atlandı.
ug: نۆۋەتتىكى تېكىست بەك قىسقا ياكى گرامماتىكىلىق تەھلىل قىلىشقا ماس كېلىدىغان تەبىئىي تىلدەك كۆرۈنمەيدۇ، شۇڭا تەھلىل ئاتلاپ ئۆتۈلدى.
uk: Поточний текст занадто короткий або не схожий на природну мову, придатну для граматичного аналізу, тому аналіз було пропущено.
ur: موجودہ متن بہت مختصر ہے یا ایسا قدرتی زبان متن نہیں لگتا جس کا قواعدی تجزیہ کیا جا سکے، اس لیے تجزیہ چھوڑ دیا گیا۔
vi: Văn bản hiện tại quá ngắn hoặc không giống ngôn ngữ tự nhiên phù hợp để phân tích ngữ pháp, vì vậy đã bỏ qua phân tích.
zh_hans: 当前文本过短，或不像适合做语法分析的自然语言内容，因此已跳过语法分析。
zh_hant: 目前文本過短，或不像適合做語法分析的自然語言內容，因此已略過語法分析。

# service.configuration.openai.endpoint.recommend
source: Recommended
ar: موصى به
bg: Препоръчано
bn: প্রস্তাবিত
ca: Recomanat
cs: Doporučeno
da: Anbefalet
de: Empfohlen
el: Προτεινόμενο
es: Recomendado
et: Soovitatav
fa: پیشنهادی
fi: Suositeltu
fil: Inirerekomenda
fr: Recommandé
he: מומלץ
hi: अनुशंसित
hr: Preporučeno
hu: Ajánlott
id: Direkomendasikan
it: Consigliato
ja: おすすめ
ka: რეკომენდებული
km: បានណែនាំ
ko: 추천
lo: ແນະນຳ
lt: Rekomenduojama
lv: Ieteicams
mn_mong: ᠰᠠᠨᠠᠯ ᠪᠣᠯᠭᠠᠭᠰᠠᠨ
ms: Disyorkan
my: အကြံပြုထားသည်
nb: Anbefalt
nl: Aanbevolen
pl: Zalecane
pt: Recomendado
pt_br: Recomendado
ro: Recomandat
ru: Рекомендовано
sk: Odporúčané
sl: Priporočeno
sr_cyrl: Препоручено
sv: Rekommenderad
ta: பரிந்துரைக்கப்படுகிறது
te: సిఫార్సు చేయబడింది
th: แนะนำ
tr: Önerilen
ug: تەۋسىيە قىلىنىدۇ
uk: Рекомендовано
ur: تجویز کردہ
vi: Đề xuất
zh_hans: 推荐
zh_hant: 推薦

source: %@ API Key
es: %@ Clave API
ja: %@ API キー
sk: %@ API kľúč
zh_hant: %@ API 金鑰

source: Add to favorites
es: Añadir a favoritos
ja: お気に入りに追加
sk: Pridať medzi obľúbené
zh_hans: 添加到收藏
zh_hant: 加入收藏

source: Advanced
es: Avanzado
ja: 高度な設定
sk: Pokročilé
zh_hans: 高级
zh_hant: 進階

source: Ali Translate
es: Traductor Ali
ja: Ali 翻訳
zh_hans: 阿里翻译
zh_hant: 阿里翻譯

source: Alignment Error
es: Error de alineación
ja: アラインメントエラー
sk: Chyba zarovnania
zh_hant: 對齊錯誤

# allow_collect_analytics
source: Allow collection of analytics
es: Permitir recopilación de análisis
ja: 分析データの収集を許可
sk: Povoliť zbieranie analytických údajov
zh_hans: 允许收集匿名统计数据
zh_hant: 允許收集分析數據

# allow_collect_crash_log
source: Allow collection of crash logs
es: Permitir recopilación de registros de errores
ja: クラッシュログの収集を許可
sk: Povoliť zbieranie záznamov o pádoch
zh_hans: 允许收集应用崩溃日志
zh_hant: 允許收集崩潰日誌

source: Analytics:
es: Análisis:
ja: 分析:
sk: Analytika:
zh_hans: 匿名统计：
zh_hant: 分析：

source: Antonyms
es: Antónimos
ja: 対義語
sk: Protiklady
zh_hans: 反义词
zh_hant: 反義詞

source: API Error
es: Error de API
ja: API エラー
sk: Chyba API
zh_hans: API 错误
zh_hant: API 錯誤

# app_shortcut_setting
source: App Shortcut
es: Atajo de la aplicación
ja: アプリ内ショートカット
sk: Skratka aplikácie
zh_hans: 应用内快捷键
zh_hant: 應用程式捷徑

# appearanceType_dark
source: Dark
es: Oscuro
ja: ダーク
sk: Tmavý
zh_hans: 深色模式
zh_hant: 黑暗模式

# appearanceType_followSystem
source: Follow System
es: Seguir sistema
ja: システムに従う
sk: Podľa systému
zh_hans: 跟随系统
zh_hant: 跟隨系統

# appearanceType_light
source: Light
es: Claro
ja: ライト
sk: Svetlý
zh_hans: 浅色模式
zh_hant: 淺色

source: Apple Dictionary
es: Diccionario Apple
ja: Apple 辞書
sk: Apple Slovník
zh_hans: 苹果词典
zh_hant: 蘋果字典

source: Apple Script Error
es: Error de Apple Script
ja: Apple Script エラー
sk: Chyba Apple Skriptu
zh_hans: Apple Script 错误
zh_hant: Apple Script 錯誤

source: Apple Translate
es: Traductor de Apple
ja: Apple 翻訳
sk: Apple Tlmočník
zh_hans: 苹果翻译
zh_hant: 蘋果翻譯

# auto_check_update
source: Automatically check for app updates
es: Buscar actualizaciones automáticamente
ja: アプリのアップデートを自動的に確認
sk: Automaticky kontrolovať pre aktualizácie
zh_hans: 自动检查应用更新
zh_hant: 自動檢查應用程式更新

source: Auto copy first translated text
es: Copiar automáticamente el primer texto traducido
ja: 最初の翻訳テキストを自動コピー
sk: Automaticky skopírovať prvý preložený text
zh_hans: 自动复制第一个翻译结果
zh_hant: 自動拷貝第一個翻譯文本

# auto_copy_ocr_text
source: Auto copy OCR text after OCR
es: Copiar automáticamente texto OCR después de OCR
ja: OCR 後にテキストを自動コピー
sk: Automaticky skopírovať OCR text po rozpoznaní
zh_hans: 自动复制截图 OCR 结果
zh_hant: OCR 完成後自動拷貝 OCR 文本

source: Auto copy selected text
es: Copiar automáticamente texto seleccionado
ja: 選択したテキストを自動コピー
sk: Automaticky skopírovať označený text
zh_hans: 自动复制划词文本
zh_hant: 自動拷貝選取的文本

# auto_query_ocr_text
source: Auto query after OCR
es: Consultar automáticamente después de OCR
ja: OCR 後に自動クエリ
sk: Automatické prekladanie po OCR
zh_hans: 图片 OCR 后自动查询
zh_hant: OCR 完成後自動查詢

# auto_query_pasted_text
source: Auto query after pasting text
es: Consultar automáticamente después de pegar texto
ja: テキスト貼り付け後に自動クエリ
sk: Automatické prekladanie po vložení textu
zh_hans: 粘贴后自动查询
zh_hant: 貼上文本後自動查詢

# auto_query_selected_text
source: Auto query after selecting text
es: Consultar automáticamente después de seleccionar texto
ja: テキスト選択後に自動クエリ
sk: Automatické prekladanie po označení textu
zh_hans: 划词后自动查询
zh_hant: 選取文本後自動查詢

# auto_query_when_text_changed
source: Auto query while typing
es: Consultar automáticamente al escribir
ja: 入力中に自動クエリ
sk: Automatické prekladanie počas písania
zh_hans: 输入时自动查询
zh_hant: 輸入時自動查詢

source: Baidu Translate
es: Traductor Baidu
ja: Baidu 翻訳
zh_hans: 百度翻译
zh_hant: 百度翻譯

source: Bing Translate
es: Traductor Bing
ja: Bing 翻訳
zh_hans: Bing 翻译
zh_hant: 必應翻譯

source: Buffer Too Small
es: Búfer demasiado pequeño
ja: バッファが小さすぎます
sk: Príliš malá vyrovnávacia pamäť
zh_hant: 緩衝區過小

# built_in_ai
source: Built-In AI Translate
es: Traducción IA integrada
ja: アプリ内 AI 翻訳
sk: Vstavaný AI prekladač
zh_hans: 内置 AI 翻译
zh_hant: 內建 AI 翻譯

source: Cancel
es: Cancelar
ja: キャンセル
sk: Zrušiť
zh_hans: 取消
zh_hant: 取消

source: Check for updates
es: Buscar actualizaciones
ja: アップデートを確認
sk: Skontrolovať aktualizácie
zh_hans: 检查更新
zh_hant: 檢查更新

source: Check Now
es: Buscar ahora
ja: 今すぐ確認
sk: Skontrolovať teraz
zh_hans: 立即检查
zh_hant: 立即檢查

# check_updates
source: Check for Updates
es: Buscar actualizaciones
ja: アップデートを確認
sk: Skontrolovať aktualizácie
zh_hans: 检查更新
zh_hant: 檢查更新

# chinese_phonetic
source: Pronunciation
es: Pronunciación
ja: 発音
sk: Výslovnosť
zh_hans: 发音
zh_hant: 發音

source: Clear All
es: Limpiar todo
ja: すべてクリア
sk: Vymazať všetko
zh_hans: 清空
zh_hant: 全部清除

source: Clear input when translating
es: Limpiar entrada al traducir
ja: 翻訳時に入力をクリア
sk: Vymazať zadaný text pri preklade
zh_hans: 输入翻译时，清空查询内容
zh_hant: 翻譯時清除輸入

source: Collocation
es: Colocación
ja: コロケーション
sk: Ustálené spojenie
zh_hans: 搭配
zh_hant: 搭配詞

# common.delete
source: Delete
es: Eliminar
ja: 削除
sk: Odstrániť
zh_hans: 删除
zh_hant: 刪除

# common.export
source: Export
es: Exportar
ja: エクスポート
sk: Exportovať
zh_hans: 导出
zh_hant: 匯出

# common.query
source: Query
es: Consulta
ja: クエリ
sk: Dotaz
zh_hans: 查询
zh_hant: 查詢

source: Comparative
es: Comparativo
ja: 比較級
sk: Porovnávací
zh_hans: 比较级
zh_hant: 比較級

# content_type_mismatch_error
source: Content-Type Mismatch
es: Content-Type no coincide
ja: Content-Type の不一致
sk: Nezhoda Content-Type
zh_hans: 响应格式不匹配
zh_hant: 回應格式不符

source: Copy Text
es: Copiar texto
ja: テキストをコピー
sk: Kopírovať text
zh_hans: 拷贝文本
zh_hant: 拷貝文本

source: Crash Log:
es: Registro de errores:
ja: クラッシュログ:
sk: Záznam o páde:
zh_hans: 崩溃日志：
zh_hant: 崩潰日誌：

# current_version %@
source: Version %@
es: Versión %@
ja: バージョン %@
sk: Verzia %@
zh_hans: 版本 %@
zh_hant: 版本 %@

source: Custom OpenAI
es: OpenAI personalizado
ja: カスタム OpenAI
sk: Vlastná OpenAI
zh_hans: 自定义 OpenAI 翻译
zh_hant: 自訂 OpenAI

source: Decode Error
es: Error de decodificación
ja: デコードエラー
sk: Chyba dekódovania
zh_hant: 解碼錯誤

source: DeepL Translate
es: Traductor DeepL
ja: DeepL 翻訳
zh_hans: DeepL 翻译
zh_hant: DeepL 翻譯

source: DeepSeek Translate
es: Traductor DeepSeek
ja: DeepSeek 翻訳
zh_hans: DeepSeek 翻译
zh_hant: DeepSeek 翻譯

source: Detected
es: Detectado
ja: 検出
sk: Zistené
zh_hans: 识别为
zh_hant: 偵測到

# disabled_app_list
source: Disabled
es: Deshabilitado
ja: 無効
sk: Zakázané
zh_hans: 禁止名单
zh_hant: 停用程式

# disabled_title
source: If the App is in the "Disabled App List", the mouse will not trigger the automatic word retrieval.
es: Si la aplicación está en la "Lista de aplicaciones deshabilitadas", el ratón no activará la recuperación automática de palabras.
ja: アプリが「無効なアプリリスト」にある場合、マウスによる自動単語取得はトリガーされません。
sk: Ak je aplikácia na zozname zakázaných aplikácií, myš nebude spúšťať automatické prekladanie.
zh_hans: 如果 App 在“禁止名单”中，则不会触发鼠标自动划词。
zh_hant: 如果應用程式在「停用的應用程式清單」中，滑鼠將不會觸發自動擷取單字。

source: Doubao Translate
es: Traductor Doubao
ja: Doubao 翻訳
zh_hans: 豆包翻译
zh_hant: 豆包翻譯

# doubao.error.http_error
source: HTTP error: %d
es: Error HTTP: %d
ja: HTTP エラー: %d
sk: Chyba HTTP: %d
zh_hans: HTTP 错误：%d
zh_hant: HTTP 錯誤：%d

# doubao.error.invalid_response
source: Invalid response
es: Respuesta inválida
ja: 無効なレスポンス
sk: Neplatná odpoveď
zh_hans: 无效的响应
zh_hant: 無效的響應

# doubao.error.missing_api_key
source: Missing Doubao API Key. Get your API key from https://www.volcengine.com/product/doubao
es: Falta la clave API de Doubao. Obtén tu clave API en https://www.volcengine.com/product/doubao
ja: Doubao API キーがありません。API キーは https://www.volcengine.com/product/doubao から取得してください
sk: Chýba Doubao API kľúč. Získajte svoj API kľúč na https://www.volcengine.com/product/doubao
zh_hans: 缺少豆包 API Key。请从 https://www.volcengine.com/product/doubao 获取您的 API Key
zh_hant: 缺少豆包 API Key。請從 https://www.volcengine.com/product/doubao 獲取您的 API Key

# error.content_type.html
source: Endpoint returned an HTML page
es: El endpoint devolvió una página HTML
ja: エンドポイントが HTML ページを返しました
sk: Koncový bod vrátil HTML stránku
zh_hans: 端点返回了 HTML 页面
zh_hant: 端點回傳了 HTML 頁面

# error.content_type.html.suggestion
source: Please check that the endpoint URL is correct and includes the full API path.
es: Comprueba que la URL del endpoint sea correcta e incluya la ruta completa de la API.
ja: エンドポイント URL が正しく、完全な API パスを含んでいるか確認してください。
sk: Skontrolujte, či je URL koncového bodu správna a obsahuje úplnú cestu API.
zh_hans: 请检查端点 URL 是否正确，是否包含完整的 API 路径。
zh_hant: 請檢查端點 URL 是否正確，是否包含完整的 API 路徑。

# error.content_type.json
source: Endpoint returned JSON instead of a stream
es: El endpoint devolvió JSON en lugar de un flujo
ja: エンドポイントがストリームではなく JSON を返しました
sk: Koncový bod vrátil JSON namiesto streamu
zh_hans: 端点返回了 JSON 而非流式响应
zh_hant: 端點回傳了 JSON 而非串流回應

# error.content_type.json.suggestion
source: Try disabling "Enable Streaming" in the service settings.
es: Prueba a desactivar "Habilitar streaming" en los ajustes del servicio.
ja: サービス設定で「ストリーミングを有効化」を無効にしてみてください。
sk: Skúste vypnúť "Povoliť streamovanie" v nastaveniach služby.
zh_hans: 请尝试在服务设置中关闭「启用流式传输」。
zh_hant: 請嘗試在服務設定中關閉「啟用串流傳輸」。

# error.content_type.unknown
source: Unexpected response format
es: Formato de respuesta inesperado
ja: 予期しないレスポンス形式
sk: Neočakávaný formát odpovede
zh_hans: 响应格式不符合预期
zh_hant: 回應格式不符合預期

# error.content_type.unknown.suggestion
source: The endpoint may not be fully OpenAI-compatible. Check the endpoint URL and API documentation.
es: Es posible que el endpoint no sea totalmente compatible con OpenAI. Comprueba la URL del endpoint y la documentación de la API.
ja: エンドポイントが OpenAI 完全互換でない可能性があります。エンドポイント URL と API ドキュメントを確認してください。
sk: Koncový bod nemusí byť plne kompatibilný s OpenAI. Skontrolujte URL a dokumentáciu API.
zh_hans: 该端点可能不完全兼容 OpenAI 接口，请检查端点 URL 和 API 文档。
zh_hant: 該端點可能不完全相容 OpenAI 介面，請檢查端點 URL 和 API 文件。

source: Etymology:
es: Etimología:
ja: 語源:
sk: Pôvod slova:
zh_hans: 词源：
zh_hant: 詞源：

source: Export Log
es: Exportar registro
ja: ログをエクスポート
sk: Exportovať záznam
zh_hans: 导出日志
zh_hant: 匯出記錄

source: Failed to allocate memory
es: No se pudo asignar memoria
ja: メモリの割り当てに失敗しました
sk: Nepodarilo sa prideliť pamäť
zh_hant: 無法配置記憶體

# favorites.empty
source: No favorites yet
es: Aún no hay favoritos
ja: お気に入りはまだありません
sk: Zatiaľ žiadne obľúbené položky
zh_hans: 暂无收藏
zh_hant: 暫無收藏

# favorites.export
source: Export Favorites
es: Exportar favoritos
ja: お気に入りをエクスポート
sk: Exportovať obľúbené položky
zh_hans: 导出收藏
zh_hant: 匯出收藏

# favorites.tab
source: Favorites
es: Favoritos
ja: お気に入り
sk: Obľúbené položky
zh_hans: 收藏
zh_hant: 收藏

# favorites.title
source: Favorites
es: Favoritos
ja: お気に入り
sk: Obľúbené položky
zh_hans: 收藏夹
zh_hant: 收藏夾

source: Feedback
es: Comentarios
ja: フィードバック
sk: Spätná väzba
zh_hans: 反馈问题
zh_hant: 意見回饋

source: Fixed window
es: Ventana fija
ja: 固定ウィンドウ
sk: Fixné okno
zh_hans: 侧悬浮窗口
zh_hant: 固定視窗

# fixed_window_position_center
source: Center of screen
es: Centro de la pantalla
ja: 画面中央
sk: Stred obrazovky
zh_hans: 屏幕中间
zh_hant: 螢幕中央

# fixed_window_position_former
source: Last position
es: Última posición
ja: 前回の位置
sk: Posledná pozícia
zh_hans: 上次位置
zh_hant: 上次位置

# fixed_window_position_mouse
source: Mouse position
es: Posición del ratón
ja: マウス位置
sk: Pozícia kurzora
zh_hans: 鼠标位置
zh_hant: 滑鼠位置

# fixed_window_position_right
source: Right side of screen
es: Lado derecho de la pantalla
ja: 画面右側
sk: Pravá strana obrazovky
zh_hans: 屏幕右侧
zh_hant: 螢幕右側

source: Font Size:
es: Tamaño de fuente:
ja: フォントサイズ:
sk: Veľkosť písma:
zh_hans: 字体大小：
zh_hant: 字體大小：

source: Function not implemented for the current algorithm
es: Función no implementada para el algoritmo actual
ja: 現在のアルゴリズムでは実装されていない関数です
sk: Funkcia nie je implementovaná pre aktuálny algoritmus
zh_hant: 目前演算法未實作此功能

source: Gemini Translate
es: Traductor Gemini
ja: Gemini 翻訳
zh_hans: Gemini 翻译
zh_hant: Gemini 翻譯

source: GitHub Models
es: Modelos de GitHub
sk: GitHub Modely
zh_hans: GitHub 模型
zh_hant: GitHub 模型

# global_shortcut_setting
source: Global Shortcut
es: Atajo global
ja: グローバルショートカット
sk: Globálna skratka
zh_hans: 全局快捷键
zh_hant: 全域快速鍵

source: Google Translate
es: Traductor de Google
ja: Google 翻訳
zh_hans: Google 翻译
zh_hant: Google 翻譯

source: Groq Translate
es: Traductor de Groq
ja: Groq 翻訳
zh_hans: Groq 翻译
zh_hant: Groq 翻譯

source: Help
es: Ayuda
ja: ヘルプ
sk: Pomocník
zh_hans: 帮助
zh_hant: 說明

source: Hide
es: Ocultar
ja: 非表示
sk: Skryť
zh_hans: 隐藏
zh_hant: 隱藏

source: Hide Menu Bar Icon
es: Ocultar icono de la barra de menús
ja: メニューバーアイコンを非表示
sk: Skryť ikonu v lište
zh_hans: 隐藏菜单栏图标
zh_hant: 隱藏選單列圖示

# hide_menu_bar_icon_msg
source: If you want to restore, open the settings page in the query window using the shortcut `Cmd + ,` then cancel the [Hide Status Bar Icon] option.
es: Si quieres restaurar, abre la página de configuración en la ventana de consulta usando el atajo `Cmd + ,` y luego cancela la opción [Ocultar icono de barra de estado].
ja: 元に戻すには、ショートカット `Cmd + ,` でクエリウィンドウの設定ページを開き、[ステータスバーアイコンを非表示] オプションを解除してください。
sk: Pre obnovenie otvor stránku s nastaveniami v okne prekladu použitím skratky ⌘ + , a potom zruš možnosť [Skryť ikonu v lište].
zh_hans: 如需恢复，请在查词窗口使用快捷键 `Cmd + ,` 打开设置页，然后取消【隐藏菜单栏图标】选项。
zh_hant: 如果您想要還原，請在查詢視窗中使用快速鍵 Cmd + , 開啟設定頁面，然後取消 [隱藏狀態列圖示] 選項。
